In [1]:
import pandas as pd

df = pd.read_csv("csv_files/expanded_employee_data.csv")

df.head()

,EmployeeID,Name,Age,Department,Position,Salary,JoiningDate,Location,Experience,Performance,Gender,LeavesTaken,ProjectsHandled,RemoteWork
0,1,Employee_1,50,Finance,Executive,72254,2010-01-31,London,29,Good,Other,29,7,Yes
1,2,Employee_2,36,Finance,Assistant,87362,2010-02-28,Toronto,3,Excellent,Female,3,7,No
2,3,Employee_3,29,Finance,Manager,60128,2010-03-31,Sydney,34,Excellent,Male,1,4,Yes
3,4,Employee_4,42,HR,Manager,99383,2010-04-30,Berlin,27,Average,Female,19,13,Yes
4,5,Employee_5,40,HR,Engineer,105545,2010-05-31,New York,13,Average,Other,15,14,No

In [11]:
# Easy Task
# Show the first 5 rows of the dataset.
# Find the total number of rows and columns.
# Get the average Age of employees.
# List all unique Departments.

clone_df = df.copy()

# Show the first 5 rows of the dataset.
# clone_df.head()

# Find the total number of rows and columns.
clone_df.shape

# Get the average Age of employees.
clone_df["Age"].mean()

# List all unique Departments.
clone_df["Department"].unique().tolist()

['Finance', 'HR', 'IT', 'Support', 'Sales', 'Marketing']

In [30]:
# Easy Tasks
# Load the dataset into pandas and display the first 10 rows.
# Check the shape (number of rows and columns).
# Get the list of column names.
# Find the average salary of all employees.
# Count how many employees are in each department.

clone_df = df.copy()
clone_df.head(10)
clone_df.shape
clone_df.columns.to_list()
# clone_df["Salary"].mean()
clone_df.loc[:,"Salary"].mean().round()
clone_df.groupby(by = "Department")["EmployeeID"].count()
clone_df["Department"].value_counts()

Department
Sales        60
Finance      59
Marketing    54
HR           48
Support      40
IT           39
Name: count, dtype: int64

In [42]:
# Medium
# Top 5 highest salaries in each Department – list employee names and salaries.
# Average LeaveTaken per Department – and sort Departments from highest to lowest.
# Employees hired after 2018 – list their Name, HireDate, and Department.
# Employees from specific countries – filter those in "USA" or "India".

clone_df = df.copy()

# Top 5 highest salaries in each Department – list employee names and salaries.
clone_df[clone_df["Salary"] > clone_df.groupby("Department")["Salary"].transform('mean')][["EmployeeID", "Name", "Salary", "Gender"]].sort_values(by = "Salary", ascending = False).reset_index(drop = True)
top5_per_dept = clone_df.groupby("Department").apply(lambda g : g.nlargest(5, "Salary")[["EmployeeID", "Name", "Department", "Salary"]]).reset_index(drop=True)
top5_per_dept


# # Average LeaveTaken per Department – and sort Departments from highest to lowest.
# clone_df.groupby("Department")["LeavesTaken"].mean().round(2).sort_values(ascending = False).reset_index()

# # Employees hired after 2018 – list their Name, HireDate, and Department.
# clone_df["JoiningDate"] = pd.to_datetime(clone_df["JoiningDate"], format = "%Y-%m-%d")
# clone_df.loc[clone_df["JoiningDate"].dt.year > 2018][["Name", "JoiningDate", "Department"]].sort_values(by = "JoiningDate", ascending = True).reset_index(drop = True)

# # Employees from specific countries – filter those in "USA" or "India".
# clone_df.loc[clone_df["Location"].isin(["India", "USA"])]

/var/folders/pz/fb1v700s76dcwmgvjy5xqh0r0000gn/T/ipykernel_34252/1160381443.py:11: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  top5_per_dept = clone_df.groupby("Department").apply(lambda g: g.nlargest(5, "Salary")[["EmployeeID", "Name", "Department", "Salary"]]).reset_index(drop=True)

    EmployeeID          Name Department  Salary
0          289  Employee_289    Finance  114532
1          154  Employee_154    Finance  113509
2          112  Employee_112    Finance  113319
3          128  Employee_128    Finance  108904
4          228  Employee_228    Finance  108836
5          263  Employee_263         HR  118757
6          216  Employee_216         HR  118623
7          220  Employee_220         HR  116534
8          223  Employee_223         HR  116218
9          100  Employee_100         HR  115683
10         163  Employee_163         IT  119026
11         288  Employee_288         IT  116908
12          26   Employee_26         IT  113698
13         165  Employee_165         IT  110835
14          94   Employee_94         IT  104772
15         232  Employee_232  Marketing  119111
16         280  Employee_280  Marketing  118344
17         111  Employee_111  Marketing  115916
18         217  Employee_217  Marketing  115629
19         237  Employee_237  Marketing  115039
20          15   Employee_15      Sales  119767
21         133  Employee_133      Sales  116589
22         104  Employee_104      Sales  116325
23         110  Employee_110      Sales  115993
24         185  Employee_185      Sales  115520
25         298  Employee_298    Support  118411
26         102  Employee_102    Support  117834
27         260  Employee_260    Support  116918
28         108  Employee_108    Support  116077
29          44   Employee_44    Support  115046

In [61]:
# 🟡 Medium Tasks
# Find the maximum bonus and the employee’s name who received it.
# Calculate the average experience of employees in the "IT" department.
# Create a new column called Total Compensation = Salary + Bonus.
# Get the top 5 highest paid employees (based on Total Compensation).
# Find how many employees have more than 5 years of experience.
clone_df = df.copy()

maximum = clone_df["Salary"].max()
clone_df.loc[clone_df["Salary"] == maximum]
# clone_df.query("Salary == 'maximum'")
# clone_df.query("Department == 'IT'")["Experience"].mean()
# clone_df.loc[clone_df["Department"] == "IT"]["Experience"].mean()
clone_df.groupby('Department')["Experience"].mean()
print(clone_df.query("index == 'IT'"))

# Create a new column called Total Compensation = Salary + Bonus.
clone_df["Bonus"] = 0
clone_df["Total Compensation"] =  clone_df["Bonus"] + clone_df["Salary"]

# Get the top 5 highest paid employees (based on Total Compensation).
top_5_clone_df = clone_df.sort_values(by = "Total Compensation", ascending = False)[["Name", "Total Compensation"]].head()

# Find how many employees have more than 5 years of experience.
print((clone_df["Experience"] > 5).sum())

Empty DataFrame
Columns: [EmployeeID, Name, Age, Department, Position, Salary, JoiningDate, Location, Experience, Performance, Gender, LeavesTaken, ProjectsHandled, RemoteWork]
Index: []
264

In [11]:
# Medium
# Find the top 5 highest salaries and their employee names.
# Calculate the average Bonus per Department.
# Count how many employees are from each Country.
# Show all employees who have PerformanceScore above 8.

clone_df = df.copy()

# Find the top 5 highest salaries and their employee names.
clone_df.sort_values(by = "Salary", ascending = False)["Name"].head(5)

# Calculate the average Bonus per Department.
# No bonus columns in my CSV file to begin with making custom bonus
clone_df["Bonus"] = 0
clone_df.groupby("Department")["Bonus"].mean()

# Count how many employees are from each Country.
clone_df.groupby("Location")["EmployeeID"].count()

# Show all employees who have PerformanceScore above 8.
clone_df.loc[clone_df["LeavesTaken"] > 8][["EmployeeID","Name","LeavesTaken"]]

     EmployeeID          Name  LeavesTaken
0             1    Employee_1           29
3             4    Employee_4           19
4             5    Employee_5           15
5             6    Employee_6           27
6             7    Employee_7           17
..          ...           ...          ...
295         296  Employee_296           27
296         297  Employee_297           24
297         298  Employee_298           12
298         299  Employee_299           19
299         300  Employee_300           16

[214 rows x 3 columns]

In [ ]:
# Hard
# Find employees with above-average Salary in their Department.
# Calculate the total Salary + Bonus payout for each Department.
# Find the Department with the highest average PerformanceScore.
# Find the top 3 employees with the most ExperienceYears.
# Create a new column "Seniority":
# Junior (≤3 years)
# Mid (4–7 years)
# Senior (≥8 years)
# Group by Country and Department to get the average Salary.

clone_df = df.copy()

# Find employees with above-average Salary in their Department.
average_salary = clone_df["Salary"].mean()
# clone_df[clone_df.loc[clone_df["Salary"] > average_salary].groupby("Department")].sort_values(by = "Salary", ascending = False).reset_index(drop = True)clone_df.groupby("Department")["Salary"].transform('mean')
clone_df[clone_df["Salary"] > clone_df.groupby("Department")["Salary"].transform("mean")][["EmployeeID", "Name", "Department", "Salary"]].sort_values(by="Salary", ascending=False).reset_index(drop=True)


# # Calculate the total Salary + Bonus payout for each Department
# # creaing custome bonus since bonus colums doesnot exist
# clone_df["Bonus"] = 0
# clone_df["Total Amount"] = clone_df["Bonus"] + clone_df["Salary"]
# clone_df.groupby("Department")["Total Amount"].sum()
# clone_df.groupby("Department").apply(lambda x: (x["Salary"] + x["Bonus"]).sum())

# # Find the Department with the highest average PerformanceScore.
# clone_df.groupby("Department")["Salary"].mean().sort_values(ascending = False).to_list()[0]

# # Find the top 3 employees with the most ExperienceYears.z
# clone_df.sort_values("Experience", ascending = False)[["EmployeeID","Name","Experience"]].reset_index(drop = True).head(3)

# # Create a new column "Seniority":
# clone_df["Seniority"] = None

# # Junior (≤3 years)
# # Mid (4–7 years)
# # Senior (≥8 years)
# clone_df["Seniority"] = clone_df["Experience"].apply(lambda x: "Junier" if x <= 3 else "Mid" if x <= 7 else "Senior")
# clone_df[["EmployeeID","Name","Experience","Seniority"]].head(20)

# # Group by Country and Department to get the average Salary.
# clone_df.groupby(["Location","Department"])["Salary"].mean()

Department
Finance    15.79661
Name: LeavesTaken, dtype: float64